//Cracked by Roath
// Room: /d/xiangyang/lvyingbi.c

inherit ROOM;

void create()
{
	set("short", "[1;32mÂÌÓ°±Ú[2;37;0m");
	set("long", @LONG
ÑÛÇ°Ò»¶Â¾Ş´óµÄÕÕ±ÚÃæ±±¶øÁ¢£¬È«±ÚÓÃÇàÂÌÉ«Ê¯ÁÏ¿ÌÆö¶ø³É¡£±Ú·ÖÈı¶Â£¬ÖĞ
¶Â×î¸ß£¬ÓÉÈıÊ®Ò»¿é´óĞÍÂÌÑâÊ¯ÏâÇ¶¶ø³É£¬ÉÏµñ¶şÁúÏ·Öéì¶ÔÆË®Ö®¼ä£»×óÓÒÁ½¶Â
¸÷¿ÌòÔÁú(dragon)·ÉÎè£¬Ö±±¼ÖĞ¶Â£¬´óÓĞ¶áÖéÖ®ÊÆ¡£ËÄÖÜÓÃ°×ÑâÊ¯Ïâ±ß£¬¾«µñĞ¡
ÁúÊıÊ®Ìõ£¬×´Ì¬¸÷Òì£¬èòèòÈçÉú¡£×ùµ×ºÍ±Ú¶¥ÒàÓÉ¾ŞÊ¯ÏâÇ¶£¬ÉÏµñ¸÷ÖÖ»¨²İ¡¢²Ê
ÔÆÍ¼°¸£¬»¨ÎÆÏ¸Äå£¬¼¼ÇÉ¶ÀÌØ¡£
LONG
	);
	set("outdoors", "xiangyang");
	set("no_clean_up", 0);
	set("item_desc", ([ /* sizeof() == 1 */
  "dragon" : "Äã×ĞÏ¸ÊıÁËÒ»ÏÂ£¬Õû¶ÂÊ¯±ÚµñÁú¾ÅÊ®¾ÅÌõ£¬²¼¾Ö»ëÈ»Ò»Ìå£¬ÆøÊÆ»Öºê°õíç¡£
",
]));
	set("exits", ([ /* sizeof() == 2 */
  "north" : __DIR__"huating",
]));

	setup();
	replace_program(ROOM);
}
