//Cracked by Roath
inherit ROOM;

string look_poem();
void create()
{
  set ("short", "石窟");
  set ("long", @LONG
这是一个唐朝时凿的石窟，这里的飞天多以个体单独行动，有的脚踏祥
云徐徐降落；有的双手抱头，从空中俯冲而下，势若流星；有的昂首挥臂，
神游太空；有的并肩遨游，窃窃私语，舞带随风悠悠漫卷。石壁上刻有李白
的【古风】(poem)。
LONG);

	set("exits", ([
                "west" : __DIR__"dtongdao4",
]));
	set("item_desc",([
                "poem"         :       (: look_poem :),
        ]));
	set("cost", 2);
  setup();
}

string look_poem()
{
        return
        "\n"
	"    ※※※※※※※※※※※※※※※※※※※※※\n"
	"    ※※※※※※※※※※※※※※※※※※※※※\n"
        "    ※※※※※※※※※※※※※※※※※※※※※\n"
        "    ※※※                            ※※※\n"
        "    ※※※                            ※※※\n"
        "    ※※※    飘    霓    虚     素   ※※※\n"
        "    ※※※                            ※※※\n"
        "    ※※※    浮    衫    步     手   ※※※\n"
        "    ※※※                            ※※※\n"
        "    ※※※    升    曳    摄     把   ※※※\n"
        "    ※※※                            ※※※\n"
        "    ※※※    天    广    太     芙   ※※※\n"
        "    ※※※                            ※※※\n"
        "    ※※※    行    带    空     蓉   ※※※\n"
        "    ※※※                            ※※※\n"
        "    ※※※                            ※※※\n"
	"    ※※※※※※※※※※※※※※※※※※※※※\n"
	"    ※※※※※※※※※※※※※※※※※※※※※\n"
	"    ※※※※※※※※※※※※※※※※※※※※※\n";
}
