//Cracked by Roath


◆明教地图◆






					     密林(40)	
						|
					   巨木旗广场(39)	
						|
					   密林深处(38)			     火器库(35)
					    /					|
   后堂(18)		 (75)内堂      林中小路(37)  烈火旗大厅(32)--山路(33)--铸造场(34)	
    |			      |		    |	      /	
 走廊(16)--藏水室(17)   (49)厚土旗大厅 密松林(36)--山路(76)
    |			     /			   |	
洪水旗大厅(15)		厚土旗校场(48)		神火峰(32)
   /			     |			   |
校场(14)		小山丘(47)		山岗(25)--天摩岭(26)	    武器库(30)	
   |         		    	\ 		/	    \		       |
洪山亭(13) ※碧水寒潭 		山道(42)  小山崖(21)	 锐金旗校场(27)--山路(28)--内厅(31)
    \			          /	      \				       |
   青云峰(12) 		       神威门(41)    山路(19)--山麓(20)		    精练场(29)	
     |		      		|              |           |
     |		   		|  ※光明顶    |           |
     |				|     |	       |           |
      \				|   摩罗门     |           |
	\			| /	  \   /		   |		  
	青石路(8)--山路(7)--甬道(5)--------甬道(6)	铁汉山(22)	
	    |   	       |	    |		   \
	 小山脚(9) 	    △石阶(3)    △石阶(4)        小山路(23)
	 / 	\	        \           /		    /
     山泉(10) ※松林林(11)     	 山门通道(2)		※乱石堆(24)	
				     |
				※明教山门(1)


						假山(69)
						  /
		西厢房(66)--院子(65)         九曲廊(68)
				|		  |
   			(64)侧厅--圣火厅(58)--侧厅(67)	
		天字门(71)	      |			风字门(73)
		    |		      |			   |
		广场(70)---------圣火门(57)---------------广场(74)					   
		    |		      |			   |	
  	 	 地字门(72) (60)龙王殿|     狮王殿(62)	雷字门(71)
			          \   |     /
				   大广场(59)
    				  /   |     \
			(61)鹰王殿    |     蝠王殿(63)
				      |	
			  军机处(53)  |   执法处(54)
				  \   |   /
				  石阶(77)
				      |
		男寝室(45)--走廊(46)--乾坤坊(52)--大食殿(43)
		     		|     |
	        	   女寝室(47) |
				      |
		       练功房(55)--石阶(51)--书院(56)		
				      |
				※摩罗门(50)

			