//Cracked by Roath
// Jay 8/9/96

inherit NPC;

void create()
{
        set_name("瘦商人", ({ "shou shangren", "shangren", "shou" }) );
        set("gender", "男性" );
        set("age", 54);
        set("long", 
	     "他瘦兮兮的，一脸穷苦相。\n");
        set("shen_type", 0);

        set("combat_exp", 150);

        set("inquiry", ([
                "here" : "我们佛山自古与朱仙、景德、汉口并称天下四大镇，端是民丰物阜，市面繁华。\n",
		"佛山" : "我们佛山自古与朱仙、景德、汉口并称天下四大镇，端是民丰物阜，市面繁华。\n",
		"英雄楼" : "英雄楼是凤老爷开的酒楼。\n",
		"锺四嫂" : "她是锺阿四的老婆，因为凤老爷怀疑她的儿子锺小三偷鹅吃，她在北帝庙把锺小三给开膛(kaitang)了，她也就疯了。\n",
		"锺阿四" : "是个住在凤老爷家旁边的菜农，他老婆是锺四嫂，就是楼下的那个疯子。\n",
		"疯子" : "她是锺四嫂。\n",
		"凤天南" : "我们都叫他凤老爷。\n",
		"锺小三" : "他是锺阿四的儿子，因为凤老爷怀疑他偷鹅吃，被她妈锺四嫂杀死了。\n",
		"凤老爷" : "凤老爷是我们佛山的第一大户，英雄楼、英雄会馆、英雄典当，都是他开的。\n",
		"英雄会馆" : "英雄会馆是凤老爷开的赌场。\n",
		"英雄典当" : "英雄典当是凤老爷开的当铺。\n",
		"北帝庙" : "那里面供着北帝爷爷，好多人都给他磕头(ketou)呢，就在镇西。\n",
		"name" : "小人的名字怎么敢说给您听。\n",
		"rumors" : "凤老爷新娶了七姨太，要高价收购锺阿四的小菜园，锺阿四还不干。\n",
	]));
        set("attitude", "friendly");

        setup();
        carry_object("/d/dali/obj/zipao")->wear();

}
