//Cracked by Roath
// yuelao.c 月老亭 
// xbc: 96/11/19
//Sure: 2000/10

#include <ansi.h>
inherit ROOM;

void create()
{
        set("short", "月老亭");
        set("long",
"
      "+HIG"≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌"NOR+"
      "+HIG"≌≌                                ≌≌"NOR+"
      "+HIG"≌≌　　　    "+HIY"月　　老　　亭"+HIG" 　     ≌≌"NOR+"
      "+HIG"≌≌                                ≌≌"NOR+"
      "+HIG"≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌"NOR+"

　　这里是扬州城的月老亭。亭子四周柱子上贴满了字条，也有些人物肖像画，
看来有不少人留了名字在这里，希望能找个如意佳偶。有几张字条被人用红笔勾
了出来，十分显眼。如果你够细心的话，也许还会在这些字条(note)里找出足以
感动你一生的爱情故事呢。常在这里卖花卖茶水的小姗姑娘双手托腮正坐在一旁
津津有味地读着书。亭子的一角放着一只大水桶。\n"
        );

        set("no_sleep_room", "1");

        set("valid_startroom",1);
        set("resource/water", 1);

        set("exits", ([
                "north" : "/d/city/dongdajie3",
                "south" : "/d/city/kantai",
                  ]));

        set("objects", ([
     //               "/d/city/obj/rose" : 2,
                    "/d/city/npc/shan" : 1,
        ]));

                  set("item_desc", ([
                                         "note" : "比武招亲范文：\n"
                         "字条一:       姗的比武招亲启示\n"
                         "字条二:       师蓉比武招亲启示\n"
                         "字条三:       啦啦呀觅偶启示\n",
                "字条一" :
"比武召亲                                 姗(Fri Mar 15)\n"
"----------------------------------------------------------------\n"
"小女子姗，年方二十，欲寻一佳偶。\n"
"\n"
"应征者需年纪二十至三十间，膂力、悟性、各项基本武功较小女子强，相\n"
"貌端正，品行良好，无不良嗜好（嗜酒、好偷不包括在内）。\n"
"\n"
"有意者请携带一定情信物，来武当山与小女子比武。遇有小女子终意者，\n"
"自会告知，许与终生。其他应征者均得纪念品乙份，鸡腿、兔肉、狗皮、\n"
"铜号、铜鼓、铜钹，不等。\n"
"\n"
"无日期限制，随到随比，请带定金创药。\n"
"\n"
"武当派第三代弟子「冰雪聪明」姗(Shan)\n",

                "字条二" :
"比武招亲                                 师蓉(Mon Aug  5)\n"
"---------------------------------------------------------\n"
"师容的比武召亲启事 \n"
"\n"
"小女子师容，年方二十，欲寻一佳偶。 \n"
"\n"
"应征者需年纪二十至三十间，相貌端正，品行良好，无不良嗜好。\n"
"注：女子，公公除外。 \n"
"\n"
"有意者请携带一定情信物，与小女子联系，并于擂台比武。\n"
"凡胜过小女子者，小女子将以身相许。\n",

                "字条三" :
"觅偶启                                 啦啦呀(Wed Nov 20)\n"
"---------------------------------------------------------\n"
"偶不在老，\n"
"是妞就行。\n"
"功不在高，\n"
"会拱就行。\n"
"要有金元宝，\n"
"有秘密最好。\n"
"丐帮的不要，华山好。\n"
"靠山最好是美黛，\n"
"实在不行江南代。\n"
"有意者拱猪房相亲\n\n"
"                       拱猪圣手－－啦啦呀\n\n"
"                          1996-11-20\n"

                  ]));

        set("cost", 0);
                  setup();
                  //"/clone/board/broker_b"->foo();

        replace_program(ROOM);
}
